Jaapdedood/3DoTBootloader/boards.txt
3DoT.name=Arxterra 3DoT
3DoT.vid.0=0x1ffb
3DoT.pid.0=0x0101
3DoT.vid.1=0x1ffb
3DoT.pid.1=0x2300
3DoT.upload.tool=arduino:avrdude
3DoT.upload.protocol=avr109
3DoT.upload.maximum_size=28672
3DoT.upload.maximum_data_size=2560
3DoT.upload.speed=57600
3DoT.upload.disable_flushing=true
3DoT.upload.use_1200bps_touch=true
3DoT.upload.wait_for_upload_port=true

3DoT.bootloader.tool=arduino:avrdude
3DoT.bootloader.low_fuses=0xE2
3DoT.bootloader.high_fuses=0xD8
3DoT.bootloader.extended_fuses=0xCF
3DoT.bootloader.file=caterina/Caterina.hex
3DoT.bootloader.unlock_bits=0xFF
3DoT.bootloader.lock_bits=0xEF

3DoT.build.mcu=atmega32u4
3DoT.build.f_cpu=8000000L
3DoT.build.vid=0x1ffb
3DoT.build.pid=0x2300
3DoT.build.usb_product="Arxterra 3DoT"
3DoT.build.usb_manufacturer="Arxterra"
3DoT.build.board=AVR_3DOT
3DoT.build.core=arduino:arduino
3DoT.build.variant=arduino:leonardo
3DoT.build.extra_flags={build.usb_flags}
